---
kind: type
id: T:Autodesk.Revit.DB.ViewNavigationToolSettings
source: html/62a69b5d-082a-85f5-e568-f15ccfec1164.htm
---
# Autodesk.Revit.DB.ViewNavigationToolSettings

Represents the settings contained in the document associated to the View Navigation tools (such as the View Cube).

## Syntax (C#)
```csharp
public class ViewNavigationToolSettings : Element
```